from collections import Counter
with open('./ccks 4_1 Data/event_entity_train_data_label.csv', 'r', encoding='utf-8') as f:
    cls_list = [line.strip().split('\t')[2] for line in f]
    print(Counter(cls_list))

"""
Counter({'NaN': 26719, '业务资产重组': 8002, '涉嫌非法集资': 4237, '债务违约': 3546, '涉嫌传销': 3440, 
'股票转让-股权受让': 3414, '信批违规': 3010, '实控人股东变更': 2172, '交易违规': 2062, '涉嫌欺诈': 1605, 
'不能履职': 1573, '涉嫌违法': 1422, '实际控制人变更': 1404, '重组失败': 1283, '评级调整': 1016, '业绩下滑': 834, 
'财务信息造假': 740, '提现困难': 710, '财务造假': 705, '高管负面': 599, '资金紧张': 592, '商业信息泄露': 554, 
'实际控制人涉诉仲裁': 519, '歇业停业': 458, '失联跑路': 425, '资产负面': 375, '资金账户风险': 372, 
'债务重组': 342, '投诉维权': 297, '履行连带担保责任': 88})
"""